In [1]:
# Pandas is a data manipulation library used fro data cleaning nad data analysis

In [3]:
# Series - It is a one dimensional array like object
# DataFrame - It is a two dimensional array like object with labeled axes

In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\sahan\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\sahan\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\sahan\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\sahan\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\sahan\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
# Series - similar to column in a table
import pandas as pd ## pd is alias
data = [1,2,3,4,5]
Ser = pd.Series(data)
print(Ser , type(Ser))

0    1
1    2
2    3
3    4
4    5
dtype: int64 <class 'pandas.core.series.Series'>

In [3]:
data1 = ("apple","banana","grapes")
ser1 = pd.Series(data1)
print(ser1,type(ser1))

0     apple
1    banana
2    grapes
dtype: object <class 'pandas.core.series.Series'>

In [7]:
## Create a series from dictionary elements 
## Keys works as an index and Values works as data
dict = {"a" : 1 ,"b" : 2 , "c" : 3}
ser = pd.Series(dict)
print(ser)

a    1
b    2
c    3
dtype: int64

In [8]:
d1 = { "name" : "Trish" , "age" : 19 , "marks" : 78}
ser = pd.Series(d1)
print(ser)

name     Trish
age         19
marks       78
dtype: object

In [14]:
## Series with manual indexing 
data = [10,20,30,40]
index = ["a","b","c","d"]
ser = pd.Series(data , index = index )
print(ser)

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
data = ["dog","cat","horse"]
ser1 = pd.Series(data,index = ["1","2","3"])
ser1

1      dog
2      cat
3    horse
dtype: object

In [18]:
# DataFrame - Table( multiple rows and columns )
# keys acts as column name and values act as rows 
## create a DataFrame from a dictionary of list
data = {
    "name" : ["Trish","Krish","John"],
    "age" : [10,23,25],
    "city" : ["Bangalore","Delhi","Mumbai"]
} 
df = pd.DataFrame(data)
print(df , type(df))

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai <class 'pandas.core.frame.DataFrame'>

In [19]:
data = {
    "a" : [1,2,3],
    "b" : [5,6,7]
}
df = pd.DataFrame(data)
print(df)

   a  b
0  1  5
1  2  6
2  3  7

In [20]:
import numpy as np
np.array(df)

array([[1, 5],
       [2, 6],
       [3, 7]], dtype=int64)

In [21]:
## create a DataFrame from a list of dictionaries
data =  [
    {"Name":"Trishansh" ,"age":34 },
    {"Name":"Divyansh" ,"age":30 },
    {"Name":"Krish" ,"age":94 }
]
df = pd.DataFrame(data)
df

        Name  age
0  Trishansh   34
1   Divyansh   30
2      Krish   94

In [23]:
## reading a csv file 
df = pd.read_csv("customers-100.csv")

In [24]:
print(df.head()) # Top - 5 records

   Index      Customer Id First Name Last Name  \
0      1  DD37Cf93aecA6Dc     Sheryl    Baxter
1      2  1Ef7b82A4CAAD10    Preston    Lozano
2      3  6F94879bDAfE5a6        Roy     Berry
3      4  5Cef8BFA16c5e3c      Linda     Olsen
4      5  053d585Ab6b3159     Joanna    Bender

                           Company               City  \
0                  Rasmussen Group       East Leonard
1                      Vega-Gentry  East Jimmychester
2                    Murillo-Perry      Isabelborough
3  Dominguez, Mcmillan and Donovan         Bensonview
4         Martin, Lang and Andrade     West Priscilla

                      Country                 Phone 1                Phone 2  \
0                       Chile            229.077.5154       397.884.0519x718
1                    Djibouti              5153435776       686-620-1820x944
2         Antigua and Barbuda         +1-539-402-0259    (496)978-3969x58947
3          Dominican Republic  001-808-617-6467x12895        +1-813-324-8756
4  Slovakia (Slovak Republic)  001-234-203-0635x76146  001-199-446-3860x3486

                         Email Subscription Date                      Website
0     zunigavanessa@smith.info        2020-08-24   http://www.stephenson.com/
1              vmata@colon.com        2021-04-23        http://www.hobbs.com/
2          beckycarr@hogan.com        2020-03-25     http://www.lawrence.com/
3  stanleyblackwell@benson.org        2020-06-02   http://www.good-lyons.com/
4      colinalvarado@miles.net        2021-04-17  https://goodwin-ingram.com/

In [25]:
print(df.tail()) # Last - 5 records

    Index      Customer Id First Name Last Name                Company  \
95     96  cb8E23e48d22Eae       Karl     Greer              Carey LLC
96     97  CeD220bdAaCfaDf       Lynn  Atkinson  Ware, Burns and Oneal
97     98  28CDbC0dFe4b1Db       Fred    Guerra          Schmitt-Jones
98     99  c23d1D9EE8DEB0A     Yvonne    Farmer     Fitzgerald-Harrell
99    100  2354a0E336A91A1   Clarence    Haynes     Le, Nash and Cross

               City          Country               Phone 1  \
95     East Richard           Guyana   (188)169-1674x58692
96     New Bradview        Sri Lanka       +1-846-706-2218
97       Ortegaland  Solomon Islands  +1-753-067-8419x7170
98  Lake Elijahview            Aruba         (530)311-9786
99        Judymouth         Honduras         (753)813-6941

                   Phone 2                           Email Subscription Date  \
95    001-841-293-3519x614                hhart@jensen.com        2022-01-30
96            605.413.3198               vkemp@ferrell.com        2021-07-10
97   +1-632-666-7507x92121                swagner@kane.org        2021-09-18
98  001-869-452-0943x12424  mccarthystephen@horn-green.biz        2021-08-11
99            783.639.1472          colleen91@faulkner.biz        2020-03-11

                              Website
95            http://hayes-perez.com/
96         https://novak-allison.com/
97              https://www.ross.com/
98               http://watkins.info/
99  http://www.hatfield-saunders.net/

In [29]:
df = pd.read_csv("customers-100.csv")
print(df.head(10))

   Index      Customer Id First Name  Last Name  \
0      1  DD37Cf93aecA6Dc     Sheryl     Baxter
1      2  1Ef7b82A4CAAD10    Preston     Lozano
2      3  6F94879bDAfE5a6        Roy      Berry
3      4  5Cef8BFA16c5e3c      Linda      Olsen
4      5  053d585Ab6b3159     Joanna     Bender
5      6  2d08FB17EE273F4      Aimee      Downs
6      7  EA4d384DfDbBf77     Darren       Peck
7      8  0e04AFde9f225dE      Brett     Mullen
8      9  C2dE4dEEc489ae0     Sheryl     Meyers
9     10  8C2811a503C7c5a   Michelle  Gallagher

                           Company               City  \
0                  Rasmussen Group       East Leonard
1                      Vega-Gentry  East Jimmychester
2                    Murillo-Perry      Isabelborough
3  Dominguez, Mcmillan and Donovan         Bensonview
4         Martin, Lang and Andrade     West Priscilla
5                     Steele Group      Chavezborough
6     Lester, Woodard and Mitchell           Lake Ana
7     Sanford, Davenport and Giles            Kimport
8                   Browning-Simon       Robersonstad
9                     Beck-Hendrix         Elaineberg

                      Country                 Phone 1                Phone 2  \
0                       Chile            229.077.5154       397.884.0519x718
1                    Djibouti              5153435776       686-620-1820x944
2         Antigua and Barbuda         +1-539-402-0259    (496)978-3969x58947
3          Dominican Republic  001-808-617-6467x12895        +1-813-324-8756
4  Slovakia (Slovak Republic)  001-234-203-0635x76146  001-199-446-3860x3486
5      Bosnia and Herzegovina     (283)437-3886x88321           999-728-1637
6            Pitcairn Islands      (496)452-6181x3291   +1-247-266-0963x4995
7                    Bulgaria    001-583-352-7197x297       001-333-145-0369
8                      Cyprus       854-138-4911x5772    +1-448-910-2276x729
9                 Timor-Leste        739.218.2516x459   001-054-401-0347x617

                         Email Subscription Date                      Website
0     zunigavanessa@smith.info        2020-08-24   http://www.stephenson.com/
1              vmata@colon.com        2021-04-23        http://www.hobbs.com/
2          beckycarr@hogan.com        2020-03-25     http://www.lawrence.com/
3  stanleyblackwell@benson.org        2020-06-02   http://www.good-lyons.com/
4      colinalvarado@miles.net        2021-04-17  https://goodwin-ingram.com/
5          louis27@gilbert.com        2020-02-25       http://www.berger.net/
6          tgates@cantrell.com        2021-08-24          https://www.le.com/
7              asnow@colon.com        2021-04-12  https://hammond-ramsey.com/
8      mariokhan@ryan-pope.org        2020-01-13     https://www.bullock.net/
9            mdyer@escobar.net        2021-11-08           https://arias.com/

In [30]:
print(df.tail(10))

    Index      Customer Id First Name Last Name                      Company  \
90     91  5ef6d3eefdD43bE       Nina    Chavez                Byrd-Campbell
91     92  98b3aeDcC3B9FF3      Shane     Foley                   Rocha-Hart
92     93  aAb6AFc7AfD0fF3     Collin     Ayers                Lamb-Peterson
93     94  54B5B5Fe9F1B6C5     Sherry     Young      Lee, Lucero and Johnson
94     95  BE91A0bdcA49Bbc    Darrell   Douglas  Newton, Petersen and Mathis
95     96  cb8E23e48d22Eae       Karl     Greer                    Carey LLC
96     97  CeD220bdAaCfaDf       Lynn  Atkinson        Ware, Burns and Oneal
97     98  28CDbC0dFe4b1Db       Fred    Guerra                Schmitt-Jones
98     99  c23d1D9EE8DEB0A     Yvonne    Farmer           Fitzgerald-Harrell
99    100  2354a0E336A91A1   Clarence    Haynes           Le, Nash and Cross

                City          Country                Phone 1  \
90    Cassidychester           Bhutan           053-344-3205
91  South Dannymouth          Hungary        +1-822-569-0302
92      South Lonnie         Anguilla       404-645-5351x012
93      Frankchester  Solomon Islands           158-687-1764
94      Daisyborough             Mali  001-084-845-9524x1777
95      East Richard           Guyana    (188)169-1674x58692
96      New Bradview        Sri Lanka        +1-846-706-2218
97        Ortegaland  Solomon Islands   +1-753-067-8419x7170
98   Lake Elijahview            Aruba          (530)311-9786
99         Judymouth         Honduras          (753)813-6941

                   Phone 2                           Email Subscription Date  \
90     +1-330-920-5422x571            elliserica@frank.com        2020-03-26
91  001-626-114-5844x55073              nsteele@sparks.com        2021-07-06
92   001-257-582-8850x8516        dudleyemily@gonzales.biz        2021-06-29
93       (438)375-6207x003     alan79@gates-mclaughlin.com        2021-04-04
94        001-769-564-6303        grayjean@lowery-good.com        2022-02-17
95    001-841-293-3519x614                hhart@jensen.com        2022-01-30
96            605.413.3198               vkemp@ferrell.com        2021-07-10
97   +1-632-666-7507x92121                swagner@kane.org        2021-09-18
98  001-869-452-0943x12424  mccarthystephen@horn-green.biz        2021-08-11
99            783.639.1472          colleen91@faulkner.biz        2020-03-11

                              Website
90              https://www.pugh.com/
91       https://www.holt-sparks.com/
92               http://www.ruiz.com/
93                https://travis.net/
94                 https://banks.biz/
95            http://hayes-perez.com/
96         https://novak-allison.com/
97              https://www.ross.com/
98               http://watkins.info/
99  http://www.hatfield-saunders.net/

In [32]:
## Accessing data from DataFrame
data = {
    "name" : ["Trish","Krish","John"],
    "age" : [10,23,25],
    "city" : ["Bangalore","Delhi","Mumbai"]
} 
df = pd.DataFrame(data)
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [33]:
df["name"]  ##series

0    Trish
1    Krish
2     John
Name: name, dtype: object

In [34]:
type(df["name"])

pandas.core.series.Series

In [35]:
df["city"]

0    Bangalore
1        Delhi
2       Mumbai
Name: city, dtype: object

In [36]:
df["age"]

0    10
1    23
2    25
Name: age, dtype: int64

In [37]:
data = {
    "name" : ["Trish","Krish","John"],
    "age" : [10,23,25],
    "city" : ["Bangalore","Delhi","Mumbai"]
} 
df = pd.DataFrame(data)
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [38]:
df.loc[0]

name        Trish
age            10
city    Bangalore
Name: 0, dtype: object

In [42]:
df.loc[1]

'Delhi'

In [43]:
df.iloc[0]

'Bangalore'

In [41]:
df.iloc[1]

name    Krish
age        23
city    Delhi
Name: 1, dtype: object

In [45]:
df.loc[0][1]

10

In [46]:
df.loc[0][2]

'Bangalore'

In [47]:
df.iloc[1][0]

'Krish'

In [48]:
df.iloc[1][1]

23

In [49]:
df.loc[2][0]

'John'

In [50]:
df.iloc[2][2]

'Mumbai'

In [ ]:
## The loc() function is label based data selecting method which means 
## that we have to pass the name of the row or column which we want to select.

In [51]:
# importing the module 
import pandas as pd 
  
# creating a sample dataframe 
data = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata', 
                               'Mahindra', 'Maruti', 'Hyundai', 
                               'Renault', 'Tata', 'Maruti'], 
                     'Year': [2012, 2014, 2011, 2015, 2012, 
                              2016, 2014, 2018, 2019], 
                     'Kms Driven': [50000, 30000, 60000, 
                                    25000, 10000, 46000, 
                                    31000, 15000, 12000], 
                     'City': ['Gurgaon', 'Delhi', 'Mumbai', 
                              'Delhi', 'Mumbai', 'Delhi', 
                              'Mumbai', 'Chennai',  'Ghaziabad'], 
                     'Mileage':  [28, 27, 25, 26, 28, 
                                  29, 24, 21, 24]}) 
  
# displaying the DataFrame 
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [54]:
data.loc[(data.Brand == "Maruti") & (data.Mileage > 25)]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [56]:
data.loc[(data.Year == 2014) & (data.Mileage < 30)]

     Brand  Year  Kms Driven    City  Mileage
1  Hyundai  2014       30000   Delhi       27
6  Renault  2014       31000  Mumbai       24

In [57]:
data.loc[(data.Year < 2019) , ['Mileage']] =22

In [58]:
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       22
1   Hyundai  2014       30000      Delhi       22
2      Tata  2011       60000     Mumbai       22
3  Mahindra  2015       25000      Delhi       22
4    Maruti  2012       10000     Mumbai       22
5   Hyundai  2016       46000      Delhi       22
6   Renault  2014       31000     Mumbai       22
7      Tata  2018       15000    Chennai       22
8    Maruti  2019       12000  Ghaziabad       24

In [59]:
data.loc[2:5]  # 5 included

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       22
3  Mahindra  2015       25000   Delhi       22
4    Maruti  2012       10000  Mumbai       22
5   Hyundai  2016       46000   Delhi       22

In [60]:
data.loc[:6]

      Brand  Year  Kms Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       22
1   Hyundai  2014       30000    Delhi       22
2      Tata  2011       60000   Mumbai       22
3  Mahindra  2015       25000    Delhi       22
4    Maruti  2012       10000   Mumbai       22
5   Hyundai  2016       46000    Delhi       22
6   Renault  2014       31000   Mumbai       22

In [61]:
## The iloc() function is an indexed-based selecting method which means 
## that we have to pass an integer index in the method to select a specific row/column.

In [62]:
data.iloc[[0,2,4,7]]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       22
2    Tata  2011       60000   Mumbai       22
4  Maruti  2012       10000   Mumbai       22
7    Tata  2018       15000  Chennai       22

In [64]:
data.iloc[[3,6,2,1]]

      Brand  Year  Kms Driven    City  Mileage
3  Mahindra  2015       25000   Delhi       22
6   Renault  2014       31000  Mumbai       22
2      Tata  2011       60000  Mumbai       22
1   Hyundai  2014       30000   Delhi       22

In [66]:
data.iloc[2: ,1:]

   Year  Kms Driven       City  Mileage
2  2011       60000     Mumbai       22
3  2015       25000      Delhi       22
4  2012       10000     Mumbai       22
5  2016       46000      Delhi       22
6  2014       31000     Mumbai       22
7  2018       15000    Chennai       22
8  2019       12000  Ghaziabad       24

In [67]:
data.iloc[3:8 , :3]  # 8 not included

      Brand  Year  Kms Driven
3  Mahindra  2015       25000
4    Maruti  2012       10000
5   Hyundai  2016       46000
6   Renault  2014       31000
7      Tata  2018       15000

In [69]:
data.iloc[1:6,1:4] # [rows,columns]

   Year  Kms Driven    City
1  2014       30000   Delhi
2  2011       60000  Mumbai
3  2015       25000   Delhi
4  2012       10000  Mumbai
5  2016       46000   Delhi

In [3]:
## Accessing a specified element using at 
data = {
    "name" : ["Trish","Krish","John"],
    "age" : [10,23,25],
    "city" : ["Bangalore","Delhi","Mumbai"]
} 
df = pd.DataFrame(data)
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [72]:
df["name"]

0    Trish
1    Krish
2     John
Name: name, dtype: object

In [74]:
df.at[1,"name"] #[row_index,column_name]

'Krish'

In [75]:
df.at[2,"city"]

'Mumbai'

In [76]:
df.at[1,"age"]

23

In [78]:
df.at[0,"age"]

10

In [79]:
## Accessing a specified element using iat 
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [81]:
df.iat[2,2] #[row,column]

'Mumbai'

In [82]:
df.iat[0,2]

'Bangalore'

In [83]:
df.iat[1,2]

'Delhi'

In [84]:
df.iat[1,0]

'Krish'

In [85]:
df.iat[2,1]

25

In [86]:
## Data Manipulation using DataFrame
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [87]:
## Adding a new column to DataFrame 
df["Salary"] = [10000,20000,30000]
df

    name  age       city  Salary
0  Trish   10  Bangalore   10000
1  Krish   23      Delhi   20000
2   John   25     Mumbai   30000

In [91]:
df["random_values"] = np.arange(100,103)
df

    name  age       city  Salary  h  random_values
0  Trish   10  Bangalore   10000  0            100
1  Krish   23      Delhi   20000  1            101
2   John   25     Mumbai   30000  2            102

In [92]:
df["game"] = ("football","cricket","volleyball")
df

    name  age       city  Salary  h  random_values        game
0  Trish   10  Bangalore   10000  0            100    football
1  Krish   23      Delhi   20000  1            101     cricket
2   John   25     Mumbai   30000  2            102  volleyball

In [96]:
## Removing a column from DataFrame 
## df.drop("Salary") ## error , you have to give axis , by default it checks row axis
df.drop("Salary",axis = 1) # It doesn't make permanent changes in df
## axis = 0 -> row-wise 
## axis = 1 -> column-wise

    name  age       city  h  random_values        game
0  Trish   10  Bangalore  0            100    football
1  Krish   23      Delhi  1            101     cricket
2   John   25     Mumbai  2            102  volleyball

In [97]:
df # It contains Salary column

    name  age       city  Salary  h  random_values        game
0  Trish   10  Bangalore   10000  0            100    football
1  Krish   23      Delhi   20000  1            101     cricket
2   John   25     Mumbai   30000  2            102  volleyball

In [98]:
## to make permanent change use (inplace = True)
df.drop("Salary" , axis = "columns" ,inplace=True)
df

    name  age       city  h  random_values        game
0  Trish   10  Bangalore  0            100    football
1  Krish   23      Delhi  1            101     cricket
2   John   25     Mumbai  2            102  volleyball

In [101]:
df.drop("game" , axis = 1, inplace = True)
df

    name  age       city  random_values
0  Trish   10  Bangalore            100
1  Krish   23      Delhi            101
2   John   25     Mumbai            102

In [102]:
df.drop("random_values" , axis = 1 , inplace = True)
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [104]:
# Removing a row from DataFrame
df.drop(0)

    name  age    city
1  Krish   23   Delhi
2   John   25  Mumbai

In [105]:
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [4]:
df.drop(0,inplace = True)
df

    name  age    city
1  Krish   23   Delhi
2   John   25  Mumbai

In [6]:
df.drop(1,inplace = True)

In [7]:
df

   name  age    city
2  John   25  Mumbai

In [8]:
df.drop(2,inplace = True)
df

Empty DataFrame
Columns: [name, age, city]
Index: []

In [9]:
df.drop("name",axis = 1,inplace = True)

In [10]:
df

Empty DataFrame
Columns: [age, city]
Index: []

In [11]:
data = {
    "name" : ["Trish","Krish","John"],
    "age" : [10,23,25],
    "city" : ["Bangalore","Delhi","Mumbai"]
} 
df = pd.DataFrame(data)
df

    name  age       city
0  Trish   10  Bangalore
1  Krish   23      Delhi
2   John   25     Mumbai

In [16]:
## Display the datatypes of each column 
df.dtypes

name    object
age      int64
city    object
dtype: object

In [17]:
## Statistical summary of DataFrame
df.describe()

             age
count   3.000000
mean   19.333333
std     8.144528
min    10.000000
25%    16.500000
50%    23.000000
75%    24.000000
max    25.000000